tap "homebrew/bundle"
tap "homebrew/services"
tap "minacle/chntpw"
tap "ngrok/ngrok"
tap "sidneys/homebrew"
brew "libtiff"
brew "jpeg-xl"
brew "aria2"
brew "python@3.11"
brew "azure-cli"
brew "bat"
brew "cabextract"
brew "python@3.12"
brew "glib"
brew "cairo"
brew "cdrtools"
brew "coreutils"
brew "deno"
brew "harfbuzz"
brew "ffmpeg"
brew "figlet"
brew "ghc"
brew "go"
brew "jq"
brew "libfido2"
brew "libpq"
brew "lsd"
brew "mkcert"
brew "mysql"
brew "mysql@8.4"
brew "n"
brew "ncurses"
brew "neofetch"
brew "neovim"
brew "openblas"
brew "pipx"
brew "r"
brew "ruby-build"
brew "rbenv"
brew "swi-prolog"
brew "tmux"
brew "tree"
brew "wimlib"
brew "minacle/chntpw/chntpw"
cask "ngrok"
cask "orbstack"
vscode "astro-build.astro-vscode"
vscode "bung87.rails"
vscode "bung87.vscode-gemfile"
vscode "cocopon.iceberg-theme"
vscode "docker.docker"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "inferrinizzard.prettier-sql-vscode"
vscode "jeff-hykin.better-cpp-syntax"
vscode "lintangwisesa.arduino"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "openai.openai-chatgpt-adhoc"
vscode "platformio.platformio-ide"
vscode "puorc.awesome-vhdl"
vscode "redhat.java"
vscode "sianglim.slim"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscodevim.vim"
vscode "wokwi.wokwi-vscode"
